################################################################################
# Prerequisites
################################################################################

tap "homebrew/bundle"

################################################################################
# Applications
################################################################################

# Java
cask temurin
cask "temurin@21"
cask "temurin@17"
cask "temurin@11"
cask "temurin@8"

# Basics
cask "google-chrome"                            # Cross-platform web browser
cask "iterm2"                                   # Terminal emulator as alternative to Apple's Terminal app
cask "slack"                                    # Instant messaging platform
cask "postman"                                  # API platform for building and using APIs

################################################################################
# Utilities
################################################################################

brew "bat"                                      # Newer `cat` utility
cask "beyond-compare"                           # Compare files and folders
brew "difftastic"                               # Git diff that understands syntax
brew "dust"                                     # More intuitive version of du in rust
brew "eza"                                      # Newer `ls` utility
brew "fd"                                       # Newer `find` utility
brew "gnupg"                                    # GNU Pretty Good Privacy (PGP) package
brew "gping"                                    # Ping, but with a graph
brew "jandedobbeleer/oh-my-posh/oh-my-posh"     #
brew "jq"                                       # Lightweight and flexible command-line JSON processor
brew "ncdu"                                     # NCurses Disk Usage
brew "openssh"                                  # OpenBSD freely-licensed SSH connectivity tools
brew "parallel"                                 # Shell command parallelization utility
brew "procs"                                    # Modern replacement for ps written by Rust
brew "stow"                                     # A symlink farm manager, used for git versioned dotfiles
brew "the_silver_searcher"                      # Code-search similar to ack
brew "tldr"                                     # Simplified and community-driven man pages
brew "tree"                                     # Display directories as trees (with optional color/HTML output)
brew "wget"                                     # Internet file retriever
brew "tmux"                                     # Terminal multiplexer
brew "zsh"                                      # UNIX shell (command interpreter)

# TODO
# uv, pip3, poetry, venv, ruff, pyspark etc

################################################################################
# Development
################################################################################

# IDE
cask "intellij-idea-ce"
cask "pycharm-ce"

# Version control
brew "git"                                      # Distributed revision control system
brew "gh"                                       # GitHub command-line tool
brew "tig"                                      # Text interface for Git repositories

# Scala
brew "sbt"                                      # Build tool for Scala projects
brew "Virtuslab/scala-cli/scala-cli"            # A command-line tool to interact with the Scala language

# Python
brew "python"

# AWS
brew "awscli"                                   # Official Amazon AWS command-line interface
brew "awslogs"                                  # Simple command-line tool to read AWS CloudWatch logs

# Terraform
brew "terraform", link: false                   # Tool to build, change, and version infrastructure
brew "terragrunt"                               # Thin wrapper for Terraform e.g. for locking state
brew "tfenv", link: true                        # Terraform version manager inspired by rbenv

# SQL
cask "dbeaver-community"                        # SQL client software application and a database administration tool

# Linters
brew "shellcheck"                               # Static analysis and lint tool, for (ba)sh scripts
brew "yamllint"                                 # Linter for YAML files

